"""
添加数据:
    append:向列表结尾处添加一个元素
    insert:向列表中指索引定位置插入元素
    extend:一次性往列表尾部添加多个元素
        注意：若传入的是字符串，则会被拆分成单个元素传入列表

删除数据：
    remove:指定元素进行删除
    pop:指定索引进行删除(不指定索引默认删除最后一个)
    clear:清空列表所有元素

修改数据：
    通过索引指定位置进行修改

查询数据:
    1、通过索引取值
    2、查找索引对应的值
    3、统计元素出现的次数


可迭代对象：
    字符串，列表，元组
"""

# append---
# list_01 = [11, 22, 33, 44]
# list_01.append("444")
# print(list_01)

# insert-- 注意索引
# list_01 = [11, 22, 33, 44]
# list_01.insert(3,"hello")
# print(list_01)

# extend-- 可传入多种类型（字符串，列表，元组）
# list_01 = [11, 22, 33, 44]
# list_01.extend(["a",1,4])
# list_01.extend("我是谁")  # 实际很少用上
# list_01.extend(("a","b",))
# print(list_01)


# remove 删除
# list_01 = ["11", 22, 33, 44, 55, 66, 77, 88, 99, 100, 110]
# list_01.remove("11")
# print(list_01)

# pop 删除  调用之后会返回删除的数据
# list_01 = ["11", 22, 33, 44, 55, 66, 77, 88, 99, 100, 110]
# res = list_01.pop(0)
# print(res)
# print(list_01)


# clear 清空列表
# list_01 = ["11", 22, 33, 44, 55, 66, 77, 88, 99, 100, 110]
# list_01.clear()
# print(list_01)

# 修改
# list_01 = ["11", 22, 33, 44, 55, 66, 77, 88, 99, 100, 110]
# list_01[0] = 1111
# print(list_01)


# 查找
# list_01 = ["11", 22, 33, 44, 55, 66, 77, 88, 99, 100, 110]
# print(list_01[3])

# 查找元素对应的索引， index/find的区别
# list_01 = ["11", 22, 33, 44, 55, 66, 77, 88, 99, 100, 110]
# print(list_01.index(22))


# 统计某个元素的个数
# list_01 = ["11", 22, 33, 44, 55, 66, 11, 11, 99, 100, 11]
# print(list_01.count(11)) # 有返回数据
# print(list_01)


